content/notes/org_reveal.org
:PROPERTIES:
:ID:       048f9912-1412-425b-b331-cfb7af8a8047
:END:
#+title: Org-reveal
#+date: [2022-05-03 Tue 13:34]
* Org Reveal
Org Reveal allows you to export [[id:31075352-280e-4ef1-978e-5c189da43657][org-mode]] documents to presentations.
Org Reveal has the following [[https://github.com/yjwen/org-reveal/][GIT repository]] and [[https://revealjs.com/][documentation]]. 
*** My configuration
Here is my personal configuration back to when I used this; Place this at the top of your OrgMode document then export with *org-export-dispach*
#+begin_src fundamental
  :reveal_properties:
  ,#+reveal_root: https://cdn.jsdelivr.net/npm/reveal.js
  ,#+reveal_reveal_js_version: 4
  ,#+reveal_theme: serif
  ,#+options: timestamp:nil toc:1 num:nil
  :end:
#+end_src

*** Every line per space
You can add this functionality with the following line:
More information could be found here: https://revealjs.com/fragments/
#+begin_src fundamental
  ,#+aatr_reveal: :frag (appear)
#+end_src
*** images
You can add and do basic manipulation with images with thefollowing line.
#+begin_src fundamental
  ,#+aatr_html: :width 45% :align center
#+end_src
