notes/org_reveal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-reveal</title>
<meta name="generator" content="Org mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/about/about'>About</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content">
<h1 class="title">org-reveal</h1>
<p>
:ID:       048f9912-1412-425b-b331-cfb7af8a8047
</p>
<div id="outline-container-orgb8393cd" class="outline-2">
<h2 id="orgb8393cd">Org Reveal</h2>
<div class="outline-text-2" id="text-orgb8393cd">
<p>
Org Reveal allows you to export Orgmode documents to presentations.
Org Reveal has the following <a href="https://github.com/yjwen/org-reveal/">GIT repository</a> and <a href="https://revealjs.com/">documentation</a>. 
</p>
</div>
<div id="outline-container-org9640ae0" class="outline-4">
<h4 id="org9640ae0">My configuration</h4>
<div class="outline-text-4" id="text-org9640ae0">
<p>
Here is my personal configuration back to when I used this; Place this at the top of your OrgMode document then export with <b>org-export-dispach</b>
</p>
<div class="org-src-container">
<pre class="src src-fundamental">:reveal_properties:
#+reveal_root: https://cdn.jsdelivr.net/npm/reveal.js
#+reveal_reveal_js_version: 4
#+reveal_theme: serif
#+options: timestamp:nil toc:1 num:nil
:end:
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3e5652" class="outline-4">
<h4 id="orgc3e5652">Every line per space</h4>
<div class="outline-text-4" id="text-orgc3e5652">
<p>
You can add this functionality with the following line:
More information could be found here: <a href="https://revealjs.com/fragments/">https://revealjs.com/fragments/</a>
</p>
<div class="org-src-container">
<pre class="src src-fundamental">#+aatr_reveal: :frag (appear)
</pre>
</div>
</div>
</div>
<div id="outline-container-org24d8bcd" class="outline-4">
<h4 id="org24d8bcd">images</h4>
<div class="outline-text-4" id="text-org24d8bcd">
<p>
You can add and do basic manipulation with images with thefollowing line.
</p>
<div class="org-src-container">
<pre class="src src-fundamental">#+aatr_html: :width 45% :align center
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:x7and7@gmail.com'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgroam in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
